Catalogs/Сообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Сообщения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тело</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Вложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>32</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вложение</Name>
							<Comment>Вложение в формате Base64</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Сообщения/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура УстHTML(ТекстHTML, Вложения)
	Тело.УстановитьHTML(ТекстHTML, Вложения);	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТекстHTML = Объект.Тело;
	Вложения = Новый Структура();
	
	Сч = 0;
	Для Каждого Зап Из Объект.Вложения Цикл
		Сч = Сч + 1;
		Ключ 		= "image00"+Строка(Сч);
		
		ЗначСтр 		= Зап.Вложение;
		ЗначБин			= Base64Значение(ЗначСтр);
		ЗначКартинка 	= Новый Картинка(ЗначБин);
		
		 Вложения.Вставить(Ключ, ЗначКартинка);
	КонецЦикла;
	УстHTML(ТекстHTML, Вложения);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ТекстHTML = "";
	Картинки = Новый Структура;
	ЭтаФорма.Тело.ПолучитьHTML(ТекстHTML, Картинки);

	Объект.Тело = ТекстHTML;
	Объект.Вложения.Очистить();
	Для Каждого Карт Из Картинки Цикл
		Новая = Объект.Вложения.Добавить();
		
		Картинка = Карт.Значение;
		Картинка.Преобразовать(ФорматКартинки.PNG);
		бинари = Картинка.ПолучитьДвоичныеДанные();
		стр = Base64Строка(бинари);	
		
		Новая.Ключ = Карт.Ключ;
		Новая.Вложение = стр;
	КонецЦикла;
КонецПроцедуры
